index.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8"/>
<title>Introduction to Haskell</title>
<meta name="author" content="(Tim McIver)"/>
<link rel="stylesheet" href="https://cdn.jsdelivr.net/npm/reveal.js@4.0.2/dist/reveal.css"/>

<link rel="stylesheet" href="https://cdn.jsdelivr.net/npm/reveal.js@4.0.2/dist/theme/night.css" id="theme"/>

<link rel="stylesheet" href="./css/style.css"/>

<!-- If the query includes 'print-pdf', include the PDF print sheet -->
</head>
<body>
<div class="reveal">
<div class="slides">
<section id="sec-title-slide"><h1 class="title">Introduction to Haskell</h1><h2 class="author">Tim McIver</h2>
</section>

<section>
<section id="slide-orgbe4de1e">
<h2 id="orgbe4de1e">First, Something Familiar</h2>
<div class="outline-text-2" id="text-orgbe4de1e">
</div>
</section>
<section id="slide-orgff7585b">
<h3 id="orgff7585b">FizzBuzz</h3>
<blockquote >
<p>
Write a program that prints the numbers from 1 to 100. But for multiples of
three print “Fizz” instead of the number and for the multiples of five print
“Buzz”. For numbers which are multiples of both three and five print “FizzBuzz”.
</p>
</blockquote>

</section>
<section id="slide-org62e32e0">
<h3 id="org62e32e0">In C#</h3>
<div class='two-col-container'>
  <div class='left-col'>
<div class="org-src-container">

<pre  class="src src-csharp"><code trim><span style="color: #b4fa70;">using</span> <span style="color: #e9b2e3;">System</span>;

<span style="color: #b4fa70;">public</span> <span style="color: #b4fa70;">class</span> <span style="color: #8cc4ff;">FizzBuzz</span> {
    <span style="color: #b4fa70;">static</span> <span style="color: #b4fa70;">public</span> <span style="color: #8cc4ff;">void</span> <span style="color: #fce94f;">Main</span> () {
        <span style="color: #b4fa70;">for</span> (<span style="color: #8cc4ff;">int</span> <span style="color: #fcaf3e;">i</span> = 1; i &lt;= 100; i++) {
            <span style="color: #b4fa70;">if</span> (i % 3 == 0 &amp;&amp; i % 5 == 0) {
                Console.<span style="color: #fce94f;">WriteLine</span>(<span style="color: #e9b96e;">"FizzBuzz"</span>);
            } <span style="color: #b4fa70;">else</span> <span style="color: #b4fa70;">if</span> (i % 3 == 0) {
                Console.<span style="color: #fce94f;">WriteLine</span>(<span style="color: #e9b96e;">"Fizz"</span>);
            } <span style="color: #b4fa70;">else</span> <span style="color: #b4fa70;">if</span> (i % 5 == 0) {
                Console.<span style="color: #fce94f;">WriteLine</span>(<span style="color: #e9b96e;">"Buzz"</span>);
            } <span style="color: #b4fa70;">else</span> {
                Console.<span style="color: #fce94f;">WriteLine</span>(<span style="color: #8cc4ff;">i</span>);
            }
        }
    }
}
</code></pre>
</div>

</div>
<div class='right-col fragment fade-in'>

<div class="org-src-container">

<pre  class="src src-haskell"><code trim><span style="color: #fce94f;">main</span> <span style="color: #fcaf3e;">=</span> putStr (unlines (map fizzBuzz [1<span style="color: #fcaf3e;">..</span>100]))
  <span style="color: #b4fa70;">where</span> fizzBuzz i <span style="color: #fcaf3e;">=</span> <span style="color: #b4fa70;">if</span> i <span style="color: #fcaf3e;">`mod`</span> 3 <span style="color: #fcaf3e;">==</span> 0 <span style="color: #fcaf3e;">&amp;&amp;</span> i <span style="color: #fcaf3e;">`mod`</span> 5 <span style="color: #fcaf3e;">==</span> 0
                     <span style="color: #b4fa70;">then</span> <span style="color: #e9b96e;">"FizzBuzz"</span>
                     <span style="color: #b4fa70;">else</span> <span style="color: #b4fa70;">if</span> i <span style="color: #fcaf3e;">`mod`</span> 3 <span style="color: #fcaf3e;">==</span> 0
                          <span style="color: #b4fa70;">then</span> <span style="color: #e9b96e;">"Fizz"</span>
                          <span style="color: #b4fa70;">else</span> <span style="color: #b4fa70;">if</span> i <span style="color: #fcaf3e;">`mod`</span> 5 <span style="color: #fcaf3e;">==</span> 0
                               <span style="color: #b4fa70;">then</span> <span style="color: #e9b96e;">"Buzz"</span>
                               <span style="color: #b4fa70;">else</span> show i
</code></pre>
</div>

  </div>
</div>
</section>
</section>
</div>
</div>
<script src="https://cdn.jsdelivr.net/npm/reveal.js@4.0.2/dist/reveal.js"></script>

<script>
// Full list of configuration options available here:
// https://github.com/hakimel/reveal.js#configuration
Reveal.initialize({
multiplex: {
    secret: '', // null if client
    id: '', // id, obtained from socket.io server
    url: '' // Location of socket.io server
},

// Optional libraries used to extend on reveal.js
dependencies: [
 { src: 'https://cdn.jsdelivr.net/npm/reveal.js@4.0.2/lib/js/classList.js', condition: function() { return !document.body.classList; } },
 { src: 'https://cdn.jsdelivr.net/npm/reveal.js@4.0.2/plugin/markdown/marked.js', condition: function() { return !!document.querySelector( '[data-markdown]' ); } },
 { src: 'https://cdn.jsdelivr.net/npm/reveal.js@4.0.2/plugin/markdown/markdown.js', condition: function() { return !!document.querySelector( '[data-markdown]' ); } },
 { src: 'https://cdn.jsdelivr.net/npm/reveal.js@4.0.2/plugin/zoom-js/zoom.js', async: true, condition: function() { return !!document.body.classList; } },
 { src: 'https://cdn.jsdelivr.net/npm/reveal.js@4.0.2/plugin/notes/notes.js', async: true, condition: function() { return !!document.body.classList; } }]
});
</script>
</body>
</html>
